esp-cpp/espp/components/m5stack-tab5/example/sdkconfig.defaults
# ESP32-P4 specific configuration
CONFIG_IDF_TARGET="esp32p4"

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Memory configuration
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_ESPP_I2C_LEGACY_API_DISABLE_DEPRECATION_WARNINGS=y

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_OFFSET=0x9000
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# M5Stack Tab5 BSP configuration
CONFIG_M5STACK_TAB5_INTERRUPT_STACK_SIZE=4096
CONFIG_M5STACK_TAB5_AUDIO_TASK_STACK_SIZE=8192
CONFIG_M5STACK_TAB5_ENABLE_WIRELESS=y
CONFIG_M5STACK_TAB5_ENABLE_CAMERA=y
CONFIG_M5STACK_TAB5_ENABLE_BATTERY_MONITORING=y

# PSRAM configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ESP Timer configuration
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144

# LVGL Configuration
CONFIG_LV_DEF_REFR_PERIOD=16

#
# LVGL configuration - # Themes
#
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=y
CONFIG_LV_THEME_DEFAULT_GROW=y
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=30
